results/test_maximum_read_throughput/fio-100g-12.log
Starting FIO benchmark on pod 12...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randread
#rwmixread=70
bs=1m
---
simple: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 10:30:12 2026
  read: IOPS=5375, BW=5376MiB/s (5637MB/s)(3150GiB/600069msec)
    slat (usec): min=37, max=5584, avg=155.02, stdev=94.25
    clat (usec): min=796, max=463563, avg=23651.16, stdev=17387.06
     lat (usec): min=970, max=463700, avg=23806.18, stdev=17384.59
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   12], 40.00th=[   13], 50.00th=[   18], 60.00th=[   27],
     | 70.00th=[   31], 80.00th=[   33], 90.00th=[   45], 95.00th=[   62],
     | 99.00th=[   69], 99.50th=[   75], 99.90th=[  230], 99.95th=[  239],
     | 99.99th=[  245]
   bw (  MiB/s): min= 3740, max= 6488, per=100.00%, avg=5378.68, stdev=48.87, samples=9592
   iops        : min= 3740, max= 6488, avg=5378.39, stdev=48.87, samples=9592
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=14.63%, 20=36.13%, 50=39.55%
  lat (msec)   : 100=9.57%, 250=0.12%, 500=0.01%
  cpu          : usr=0.37%, sys=11.07%, ctx=3199186, majf=0, minf=43670
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3225883,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=5376MiB/s (5637MB/s), 5376MiB/s-5376MiB/s (5637MB/s-5637MB/s), io=3150GiB (3383GB), run=600069-600069msec
FIO benchmark completed on pod 12