results/test_maximum_read_throughput/fio-100g-5.log
Starting FIO benchmark on pod 5...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randread
#rwmixread=70
bs=1m
---
simple: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 10:30:57 2026
  read: IOPS=7426, BW=7427MiB/s (7787MB/s)(4352GiB/600026msec)
    slat (usec): min=36, max=5109, avg=123.11, stdev=88.49
    clat (usec): min=817, max=284528, avg=17110.32, stdev=9770.05
     lat (usec): min=885, max=284629, avg=17233.43, stdev=9779.50
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[    8], 10.00th=[    9], 20.00th=[    9],
     | 30.00th=[   10], 40.00th=[   11], 50.00th=[   17], 60.00th=[   19],
     | 70.00th=[   20], 80.00th=[   26], 90.00th=[   32], 95.00th=[   34],
     | 99.00th=[   39], 99.50th=[   41], 99.90th=[   56], 99.95th=[   77],
     | 99.99th=[  245]
   bw (  MiB/s): min= 5200, max= 9316, per=100.00%, avg=7429.41, stdev=59.71, samples=9597
   iops        : min= 5200, max= 9316, avg=7428.90, stdev=59.72, samples=9597
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=34.80%, 20=35.98%, 50=29.05%
  lat (msec)   : 100=0.11%, 250=0.03%, 500=0.01%
  cpu          : usr=0.43%, sys=12.18%, ctx=4424721, majf=0, minf=16758
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4456033,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=7427MiB/s (7787MB/s), 7427MiB/s-7427MiB/s (7787MB/s-7787MB/s), io=4352GiB (4673GB), run=600026-600026msec
FIO benchmark completed on pod 5