results/test_maximum_read_throughput/fio-100g-6.log
Starting FIO benchmark on pod 6...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randread
#rwmixread=70
bs=1m
---
simple: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 10:30:49 2026
  read: IOPS=4868, BW=4869MiB/s (5105MB/s)(2853GiB/600042msec)
    slat (usec): min=38, max=9000, avg=143.94, stdev=86.94
    clat (msec): min=2, max=316, avg=26.14, stdev=13.65
     lat (msec): min=2, max=316, avg=26.29, stdev=13.64
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   12], 10.00th=[   14], 20.00th=[   16],
     | 30.00th=[   19], 40.00th=[   21], 50.00th=[   24], 60.00th=[   28],
     | 70.00th=[   31], 80.00th=[   39], 90.00th=[   43], 95.00th=[   45],
     | 99.00th=[   50], 99.50th=[   54], 99.90th=[  232], 99.95th=[  247],
     | 99.99th=[  255]
   bw (  MiB/s): min= 2404, max= 5694, per=100.00%, avg=4870.83, stdev=50.07, samples=9596
   iops        : min= 2404, max= 5694, avg=4870.38, stdev=50.07, samples=9596
  lat (msec)   : 4=0.01%, 10=0.90%, 20=36.81%, 50=61.37%, 100=0.77%
  lat (msec)   : 250=0.12%, 500=0.03%
  cpu          : usr=0.33%, sys=9.32%, ctx=2916242, majf=0, minf=68117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2921282,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=4869MiB/s (5105MB/s), 4869MiB/s-4869MiB/s (5105MB/s-5105MB/s), io=2853GiB (3063GB), run=600042-600042msec
FIO benchmark completed on pod 6