results/test_maximum_read_throughput/fio-100g-8.log
Starting FIO benchmark on pod 8...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randread
#rwmixread=70
bs=1m
---
simple: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 10:32:17 2026
  read: IOPS=6446, BW=6447MiB/s (6760MB/s)(3778GiB/600015msec)
    slat (usec): min=38, max=7312, avg=150.00, stdev=82.08
    clat (usec): min=906, max=453022, avg=19701.99, stdev=14408.36
     lat (usec): min=1104, max=453072, avg=19851.99, stdev=14401.99
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   12], 50.00th=[   14], 60.00th=[   20],
     | 70.00th=[   22], 80.00th=[   31], 90.00th=[   39], 95.00th=[   46],
     | 99.00th=[   58], 99.50th=[   61], 99.90th=[  218], 99.95th=[  236],
     | 99.99th=[  247]
   bw (  MiB/s): min= 2624, max=13518, per=99.98%, avg=6446.06, stdev=237.56, samples=9592
   iops        : min= 2624, max=13518, avg=6445.84, stdev=237.57, samples=9592
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=20.39%, 20=42.15%, 50=34.12%
  lat (msec)   : 100=3.18%, 250=0.13%, 500=0.01%
  cpu          : usr=0.42%, sys=12.79%, ctx=3858049, majf=0, minf=78437
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3868243,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=6447MiB/s (6760MB/s), 6447MiB/s-6447MiB/s (6760MB/s-6760MB/s), io=3778GiB (4056GB), run=600015-600015msec
FIO benchmark completed on pod 8